from database import get_connection


stations = [
    ("Калита", "Газпром", None, "Калуга"),
    ("Лихуны", "Газпромнефть", None, "Калуга"),
    ("Мстихино", "Teboil", "Центральная, 45Б", "Калуга"),
    ("Железняки", "Газпром", "Железняки, 40А", "Калуга"),
    ("Железняки", "Роснефть", "Железняки, 31", "Калуга"),
    ("Правый", "Роснефть", "Правобережный пр., 15", "Калуга"),
    ("Правый", "Газпром", "Правобережный пр., 4", "Калуга"),
    ("Грабцевское", "Газпромнефть", "Грабцевское ш., 71А", "Калуга"),
    ("Грабцевское", "Газпром", "Грабцевское ш., 99Б", "Калуга"),
    ("Грабцевское", "Роснефть", "Грабцевское ш., 27", "Калуга"),
    ("Северо-Щедрина", "Роснефть", "Северо-Щедрина, 76 к2", "Калуга"),
    ("40 лет Октября", "Лукойл", "40 лет Октября, 1А", "Калуга"),
    ("Хрустальная", "Лукойл", "Хрустальная, 62А", "Калуга"),
    ("Гурьянова", "Газпром", "Гурьянова, 73А", "Калуга"),
    ("Трифоновская", "Газпромнефть", "Трифоновская", "Калуга"),
    ("Московская", "Газпром", "Московская, 328Б", "Калуга"),
    ("Путейская", "Газпром", "Путейская, 12", "Калуга"),
]


conn = get_connection()
cursor = conn.cursor()

for display_name, brand, address, city in stations:

    cursor.execute("""
        INSERT INTO stations
        (display_name, brand, address, city)
        VALUES (?, ?, ?, ?)
    """, (
        display_name,
        brand,
        address,
        city
    ))

conn.commit()
conn.close()

print(f"✅ Добавлено АЗС: {len(stations)}")